In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.5.3

In [8]:
A = pd.Series([3,4,5,6], index=['b','a','c','d'])

In [14]:
B=pd.Series({'A':4,'B':3,'C':2,'D':1})

In [4]:
type(A.values)

numpy.ndarray

In [5]:
type(A.index)

pandas.core.indexes.base.Index

In [6]:
type(A)

pandas.core.series.Series

In [9]:
A['a']

4

In [10]:
A['b':'c']

b    3
a    4
c    5
dtype: int64

In [12]:
A['a':'d']

a    4
c    5
d    6
dtype: int64

In [13]:
A['a':'b']

Series([], dtype: int64)

In [15]:
B

A    4
B    3
C    2
D    1
dtype: int64

In [31]:
grades = {'A':4, 'B':3, 'C':2, 'D':1, 'F':0}
marks = {'A':85, 'B':75, 'C':65, 'D':55, 'F':0}

In [32]:
D = pd.DataFrame({'Score': marks, 'Grade Point': grades})

In [33]:
D

   Score  Grade Point
A     85            4
B     75            3
C     65            2
D     55            1
F      0            0

In [34]:
D.T

              A   B   C   D  F
Score        85  75  65  55  0
Grade Point   4   3   2   1  0

In [35]:
D.values

array([[85,  4],
       [75,  3],
       [65,  2],
       [55,  1],
       [ 0,  0]])

In [36]:
D.values[2,0]

65

In [37]:
D.columns

Index(['Score', 'Grade Point'], dtype='object')

In [43]:
D['Scaled from 90'] = D['Score'] / 100 * 90

In [45]:
del D['ScaledMarks']

In [46]:
D

   Score  Grade Point  Scaled from 90
A     85            4            76.5
B     75            3            67.5
C     65            2            58.5
D     55            1            49.5
F      0            0             0.0

In [49]:
Pass = D[(D['Score'] > 50) & (D['Grade Point'] >= 2)]

In [50]:
Pass

   Score  Grade Point  Scaled from 90
A     85            4            76.5
B     75            3            67.5
C     65            2            58.5

In [51]:
pd.DataFrame([{'a':1,'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0